def shell_sort(lst):   #Фунція, яка приймає масив
    gap = len(lst) // 2  #змінна, яка відповідає за діапазон між яким будуть порівнюватися 2 числа  

    while gap > 0:    #цикл while коли gap більше за нуль
        for value in range(gap, len(lst)):    #цикл for 
            current_value = lst[value]   #змінна current_value і привласнимо їй значення поточного елементу
            position = value    #змінна position, яка відповідає за значення індекса числа

            while position >= gap and lst[position - gap] > current_value:    #цикл while умови якого, поки значення індекса буде більше або дорівнює gap і при цьому елемент порівняний з потомчним значенням буде дільше нього
                lst[position] = lst[position - gap]   #всередині циклу ми будемо змінювати порівняні елементи місцями
                position -= gap    #всередині циклу ми будемо змінювати порівняні елементи місцями
                lst[position] = current_value    #всередині циклу ми будемо змінювати порівняні елементи місцями

        gap //= 2    #змінна gap ділиться на 2
    return lst   #повертає відсортований масив


lst = [12, 34, 25, 15, 67, 23, 11, 86]   #змінна lst яка містить в собі не відсортирований масив
print("Вихідний масив: ", lst)   #буде показаний не відсортований масив результат роботи сортування
result = shell_sort(lst)     #результат сортування
print("Результат сортування: ", result)     #результат сортування